const policeStations = [
  ["शिरूर", "रविंद्र काळे", "9960666441", "shirurps", "shirurps@123"],
  ["शिक्रापूर", "अमोल दांडगे", "9552512690", "shikrapurps", "shikrapurps@123"],
  ["रांजणगाव", "औटी", "9922745151", "ranjngavps", "ranjngavps@123"],
  ["लोणावळा शहर", "स्वप्नील पाटील", "9011686907", "lonacityps", "Ionacityps@123"],
  ["लोणावळा ग्रामीण", "विजय मुंढे", "9403217270", "lonatalps", "IonataIps@123"],
  ["कामशेत", "नितीन कलसैत", "9850259911", "kamshetps", "kamshetps@123"],
  ["वडगाव मावळ", "चेतन कुंभार", "9881811589", "vadgmavalps", "vadgmavalps@123"],
  ["मंचर", "विशाल दळवी", "9561166625", "macharps", "macharps@123"],
  ["खेड", "संतोष घोलप", "9823577333", "khedps", "khedps@123"],
  ["पारगाव", "गजानन ढाके", "9545696670", "pargavps", "pargavps@123"],
  ["घोडगाव", "नलावडे", "8888050982", "ghodegavps", "ghodegavps@123"],
  ["जुन्नर", "दादा पवाडे", "9404805304", "junnarps", "junnarps@123"],
  ["ओतुर", "जोतीराम पवार", "8308345782", "oturps", "oturps@123"],
  ["आळेफाटा", "पोपट कोकाटे", "8975636567", "alephataps", "alephataps@123"],
  ["नारायणगाव", "गोरक्ष हसे", "9604695677", "narayanps", "narayanps@123"],
  ["अप्पर पोलीस अधि. वाचक", "गणेश ठोसर", "9764355657", "addread", "addread@123"],
  ["सायबर", "संतोष देवाडे", "9823153323", "cyberbr", "cyberbr@123"],
  ["कल्याण शाखा", "प्रवीण मुंढे", "9923294794", "kalbr", "kalbr@123"],
  ["टी.एम.सी", "विकास सोनवणे", "9822747966", "tmcbr", "tmcbr@123"],
  ["बी.डी.डी.एस", "सतीश गेंगझे", "7776924209", "bddsbr", "bddsbr@123"],
  ["नियंत्रण कक्ष", "साधना वाघुले", "7517744643", "controlbr", "controlbr@123"],
  ["अर्ज शाखा", "एस.एस. शेवाळे", "9561372528", "arjbr", "arjbr@123"],
  ["मोटार परिवहन", "मनोज शेडगे", "9112119889", "mtvbr", "mtvbr@123"],
  ["सी.सी.टी.एन.एस", "मनीषा डमरे", "8888447525", "cctnsbr", "cctnsbr@123"],
  ["वाहतूक विभाग", "स्वप्नाली पवार", "9011081035", "vahtbr", "vahtbr@123"],
  ["दहशत विरोधी", "विशाल गोरडे", "8308831928", "atsbr", "atsbr@123"],
  ["मुख्यालय", "राजू दरगुले", "7758908290", "hqpune", "hqpune@123"],
  ["एस.डी.पी.ओ खेड", "दिनेश टेमकर", "7020894611", "dykheddo", "dykhed@123"],
  ["एस.डी.पी.ओ लोणावळा", "कवळे", "9923340034", "dylonavlado", "dylonavla@123"],
  ["एस.डी.पी.ओ शिरूर", "प्रकाश झेंडे", "7755997386", "dyshirurdo", "dyshirur@123"],
  ["एस.डी.पी.ओ जुन्नर", "वैशाली कोंकिरी", "7276296360", "dyjunnardo", "dyjunnar@123"],
  ["कोरेगाव भीमा", "आण्णा चिंचकर", "9823224802", "korvish", "korvish@123"],
 ["अप्पर पोलीस अधिक्षक बारामती", "तांडुलकर", "9823545599", "addlbar", "addlbar@123"],
  ["बारामती शहर पो स्टे", "भगवान दुधे", "9921204135", "baramatict", "baramatict@123"],
  ["बारामती तालुका पो स्टे", "ओंकार पवार", "7083169390", "baramatital", "baramatital@123"],
  ["बारामती वाहतुक", "अजिंक्य कदम", "9667900100", "baeva", "barvah@123"],
  ["माळेगाव पो स्टे", "नितीन कांबळे", "9960252878", "malegav", "malegav@123"],
  ["वडगाव निंबाळकर पो स्टे", "पोपट नाळे", "9689898702", "vadgaonnim", "vadgaonnim@123"],
  ["वालचंदनगर पो स्टे", "अमोल चिटकोटे", "7447420303", "valchandps", "valchandps@123"],
  ["इंदापुर पो स्टे", "अकबर शेख", "9922145218", "indapurps", "indapurps@123"],
  ["भिगवण पो स्टे", "रणजीत मुळीक", "9970460459", "bhingvanps", "bhingvanps@123"],
  ["सुपा पो स्टे", "सचिन कोकणे", "9830414370", "supaps", "suppal@123"],
  ["दौंड पो स्टे", "आमिर शेख", "8888899708", "daundps", "daundps@123"],
  ["यवत पो स्टे", "शिवम मुळे", "9860637325", "yavatps", "yavatps@123"],
  ["उरुळी कांचन पो स्टे", "सुवर्णा गायकवाड", "9922643867", "uralips", "uralips@123"],
  ["भोर पो स्टे", "धर्मवीर खांडे", "9011082328", "bhorps", "bhorps@123"],
  ["सासवड पो स्टे", "विकास ओमासे", "9822581380", "saswadps", "saswadps@123"],
  ["जेजुरी पो स्टे", "शिवाजी काटे", "8329432267", "jejurips", "jejurips@123"],
  ["राजगड पो स्टे", "राजेश घायाळ", "9860533869", "rajgadps", "rajgadps@123"],
  ["हवेली पो स्टे", "सोनाली जाधव", "7038086654", "havelips", "havelips@123"],
  ["वेल्हा पो स्टे", "असुंधे", "8668674047", "velhaps", "velhaps@123"],
  ["पौड पो स्टे", "गणेश पवार", "8888212831", "paudps", "paudps@123"],
  ["जिल्हा विषेष शाखा", "पल्लवी गायकवाड", "9881027733", "distdsb", "distdsb@123"],
  ["सुरक्षा शाखा", "सुनीता मोरे", "9503091298", "surksha", "surksha@123"],
  ["एफ.आर.ओ", "शिल्पा शिंदे", "7775098222", "frobr", "frobr@123"],
  ["पोलीस अधिक्षक वाचक", "असीम बेग", "8087011618", "readerbr", "readerbr@123"],
  ["स्थानिक गुन्हे शाखा", "पासलकर", "9923203187", "Icbbr", "lcbbr@123"],
  ["महीला कक्ष", "सीमा जगताप", "8208002037", "womencell", "womencell@123"],
  ["AHTU अनैतिक मानवी वाहतुक प्रतिबंध कक्ष", "ज्योती भांबळे", "7447430784", "ahtubr", "ahtubr@123"],
  ["आर्थिक गुन्हे शाखा", "वर्षा धुमाळ", "9923421599", "eowbr", "eowbr@123"],
  ["SDPO हवेली कार्यालय", "चौबे", "8329578282", "dyhavelido", "dyhaveli@123"],
  ["SDPO भोर कार्यालय", "दत्तात्रय खेंगरे", "9527901668", "dybhordo", "sdpobhor@321"],
  ["SDPO दौंड कार्यालय", "सुभाष डोईफोडे", "8381024079", "dydaunddo", "dydaund@123"],
  ["SDPO बारामती कार्यालय", "अतुल जाधव", "8668510084", "dybaramatido", "sdpobara@321"]
];

const tableBody = document.getElementById("stationTableBody");

policeStations.forEach((entry, index) => {
  const tr = document.createElement("tr");

  const [station, officer, mobile, login, password] = entry;

  tr.innerHTML = `
    <td>${index + 1}</td>
    <td>${station}</td>
    <td>${officer || "-"}</td>
    <td>${mobile || "-"}</td>
    <td>${mobile ? `<a href="tel:${mobile}" title="Call">📞</a>` : "-"}</td>
   <td>${
  mobile
    ? `<a href="https://wa.me/91${mobile}" target="_blank" title="WhatsApp">
         <img src="watsappicon.png" alt="WhatsApp" style="width:28px; height:28px;">
       </a>`
    : "-"
}</td>
    <td>${login}</td>
    <td>${password}</td>
  `;

  tableBody.appendChild(tr);
const creatorDiv = document.getElementById("creator");
creatorDiv.innerHTML = `
  Created By: पो.कॉ.तौफिक.एन.शेख <br>
  Guidance: प्रवीण मोरे (जिल्हा विशेष शाखा)
`;
creatorDiv.style.color = "#003366";
creatorDiv.style.fontSize = "25px";

});
