document.addEventListener("DOMContentLoaded", () => {
  const tableBody = document.getElementById("stationTableBody");

  const policeStations = [
  ["शिरूर", "रविंद्र काळे", "9960666441", "shirurps", "02138–222139"],
["शिक्रापूर", "अमोल दांडगे", "9552512690", "shikrapurps", "02137–286333"],
["रांजणगाव", "औटी", "9922745151", "ranjngavps", "02138–232139"],
["लोणावळा शहर", "स्वप्नील पाटील", "9011686907", "lonacityps", "02114–273033"],
["लोणावळा ग्रामीण", "विजय मुंढे", "9403217270", "lonatalps", "02114–273036"],
["कामशेत", "नितीन कलसैत", "9850259911", "kamshetps", "02114–262440"],
["वडगाव मावळ", "चेतन कुंभार", "9881811589", "vadgmavalps", "02114–235333"],
["मंचर", "विशाल दळवी", "9561166625", "macharps", "02133–223159"],
["खेड", "संतोष घोलप", "9823577333", "khedps","02135–222033"],
["पारगाव", "गजानन ढाके", "9545696670", "pargavps", ""],
["घोडगाव", "नलावडे", "8888050982", "ghodegavps", "02133–244133"],
["जुन्नर", "दादा पवाडे", "9404805304", "junnarps", "02132–222033"],
["ओतुर", "जोतीराम पवार", "8308345782", "oturps", "02132–264250"],
["आळेफाटा", "पोपट कोकाटे", "8975636567", "alephataps", "02132–263033"],
["नारायणगाव", "गोरक्ष हसे", "9604695677", "narayanps", "02132–242033"],
["इंदापुर", "अकबर शेख", "9922145218", "indapurps", "02118–223333"],
["भिगवण", "रणजीत मुळीक", "9970460459", "bhingvanps", "02118–246233"],
["बारामती शहर", "भगवान दुधे", "9921204135", "baramatict", "02112–224333"],
["बारामती तालुका", "ओंकार पवार", "7083169390", "baramatital", "02112–243433"],
["बारामती वाहतुक", "अजिंक्य कदम", "9667900100", ""],
["माळेगाव", "नितीन कांबळे", "9960252878", "malegav", "02112–254318"],
["वडगाव निंबाळकर", "पोपट नाळे", "9689898702", "vadgaonnim", "02112–272133"],
["वालचंदनगर", "अमोल चिटकोटे", "7447420303", "valchandps", "02118–272350"],
["सुपा", "सचिन कोकणे", "9830414370", "supaps", "02112–202033"],
["दौंड", "आमिर शेख", "8888899708", "daundps", "02117–262333"],
["यवत", "शिवम मुळे", "9860637325", "yavatps", "02119–274233"],
["उरुळी कांचन", "सुवर्णा गायकवाड", "9922643867", "uralips", "020–26926287"],
["भोर", "धर्मवीर खांडे", "9011082328", "bhorps", "02113–222533"],
["सासवड", "विकास ओमासे", "9822581380", "saswadps","02115–222333"],
["जेजुरी", "शिवाजी काटे", "8329432267", "jejurips", "02115–253129"],
["राजगड", "राजेश घायाळ", "9860533869", "rajgadps", "02113–272233"],
["हवेली", "सोनाली जाधव", "7038086654", "havelips", "020–24392733"],
["वेल्हा", "असुंधे", "8668674047", "velhaps", "02130–221233"],
["पौड", "गणेश पवार", "8888212831", "paudps", "020–22943233"],
["अप्पर पोलीस अधी. वाचक", "गणेश ठोसर", "9764355657", "addread", ""],
["सायबर", "संतोष देवाडे", "9823153323", "cyberbr", ""],
["कल्याण शाखा", "प्रवीण मुंढे", "9923294794", "kalbr", ""],
["टी.एम.सी", "विकास सोनवणे", "9822747966", "tmcbr", ""],
["बी.डी.डी.एस", "सतीश गेंगझे", "7776924209", "bddsbr", ""],
["नियंत्रण कक्ष", "साधना वाघुले", "7517744643", "controlbr", ""],
["अर्ज शाखा", "एस.एस. शेवाळे", "9561372528", "arjbr", ""],
["मोटार परिवहन", "मनोज शेडगे", "9112119889", "mtvbr", ""],
["सी.सी.टी.एन.एस", "मनीषा डमरे", "8888447525", "cctnsbr", ""],
["वाहतूक विभाग", "स्वप्नाली पवार", "9011081035", "vahtbr", ""],
["दहशत विरोधी", "विशाल गोरडे", "8308831928", "atsbr", ""],
["मुख्यालय", "राजू दरगुले", "7758908290", "hqpune", ""],
["एस.डी.पी.ओ खेड", "दिनेश टेमकर", "7020894611", "dykheddo", ""],
["एस.डी.पी.ओ लोणावळा", "कवळे", "9923340034", "dylonavlado", ""],
["एस.डी.पी.ओ शिरूर", "प्रकाश झेंडे", "7755997386", "dyshirurdo", ""],
["एस.डी.पी.ओ जुन्नर", "वैशाली कोंकिरी", "7276296360", "dyjunnardo", ""],
["कोरेगाव भीमा", "आण्णा चिंचकर", "9823224802", "korvish", ""],
["अप्पर पोलीस अधिक्षक बारामती", "तांडुलकर", "9823545599", "addlbar", ""],
["जिल्हा विषेष शाखा", "पल्लवी गायकवाड", "9881027733", "distdsb", ""],
["सुरक्षा शाखा", "सुनीता मोरे", "9503091298", "surksha", ""],
["एफ.आर.ओ", "शिल्पा शिंदे", "7775098222", "frobr", ""],
["पोलीस अधिक्षक वाचक", "असीम बेग", "8087011618", "readerbr",""],
["स्थानिक गुन्हे शाखा", "पासलकर", "9923203187", "Icbbr", ""],
["महीला कक्ष", "सीमा जगताप", "8208002037", "womencell", ""],
["AHTU अनैतिक मानवी वाहतुक प्रतिबंध कक्ष", "ज्योती भांबळे", "7447430784", "ahtubr", ""],
["आर्थिक गुन्हे शाखा", "वर्षा धुमाळ", "9923421599", "eowbr", ""],
["SDPO हवेली कार्यालय", "चौबे", "8329578282", "dyhavelido", ""],
["SDPO भोर कार्यालय", "दत्तात्रय खेंगरे", "9527901668", "dybhordo", ""],
["SDPO दौंड कार्यालय", "सुभाष डोईफोडे", "8381024079", "dydaunddo",""],
["SDPO बारामती कार्यालय", "अतुल जाधव", "8668510084", "dybaramatido", ""]

];

 policeStations.forEach((stationInfo, index) => {
    const [station, officer, mobile, username, landline] = stationInfo;

    const tr = document.createElement("tr");
    tr.innerHTML = `
      <td>${index + 1}</td>
      <td>${station}</td>
      <td>${officer || "-"}</td>
      <td>${mobile || "-"}</td>
      <td>${mobile ? `<a href="tel:${mobile}" title="Call">📞</a>` : "-"}</td>
      <td>
        ${
          mobile
            ? `<a href="https://wa.me/91${mobile}" target="_blank" title="WhatsApp">
                 <img src="watsappicon.png" alt="WhatsApp" style="width:28px; height:28px;">
               </a>`
            : "-"
        }
      </td>
      <td>${username}</td>
      <td>${landline ? `<a href="tel:${landline}">${landline}</a>` : "-"}</td>
    `;
    tableBody.appendChild(tr);
  });

  const creatorDiv = document.getElementById("creator");
  creatorDiv.innerText = "Created By: पो.कॉ. तौफिक एन. शेख | मार्गदर्शन: वरि.पो.नि. प्रविण मोरे";
  creatorDiv.style.color = "#003366";
  creatorDiv.style.fontSize = "20px";
});
  const creatorDiv = document.getElementById("creator");
  creatorDiv.innerText = "Created By: पो.कॉ. तौफिक एन. शेख | मार्गदर्शन: वरि.पो.नि. प्रविण मोरे";
  creatorDiv.style.color = "#003366";
  creatorDiv.style.fontSize = "20px";


